tap "azure/kubelogin"
tap "hashicorp/tap"
# Simple, modern, secure file encryption
brew "age"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Port scanning utility for large networks
brew "nmap"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# Terraform
brew "hashicorp/tap/terraform"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Enable Windows-like alt-tab
cask "alt-tab"
# Display management tool
cask "betterdisplay"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Developer platform
cask "dotnet-sdk"
# Developer platform
cask "dotnet-sdk@8"
# Developer platform
cask "dotnet-sdk@9"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source code editor
cask "visual-studio-code"
# Connect to Windows
cask "windows-app"
vscode "github.copilot"
vscode "github.copilot-chat"
